专业技能
1.熟悉常用的数据结构与算法，了解计算机网络、操作系统等基础知识。 2.熟练掌握HTML5、CSS3以及JavaScript基础。 3.掌握Vue、ElementUI、uni-app等前端框架。 4.熟悉web应用的部署、域名申请、备案、https认证等过程。 5.掌握Github、Git 、WebPack等工具的使用。
项目经历
基于Vue的小米商城首页仿写
2020年4月 - 2021年6月
  项目介绍:Vue的小米商城首页仿写，基于Vue+Vue-Router+Vuex+Element-ui+axios实现的。
主页面包括商品列表、商品介绍视频，项目API、图片等静态资源都是直接引用官网的。
项目收获:学习了Vue的组件化思想，项目组件化复用。学习了Element-ui样式的使用以及Vue的生命周期,使用vuex做状态管
理。
项目地址:http://yuangauss287.top/#/
智能家居控制系统 2020年8月 - 2021年9月
项目介绍:该项目使用gy39传感器收集光照强度、温度、湿度、大气压强等数据，通过手机扫描硬件屏幕二维码显示收集的数 据并能控制硬件。前端部分基于Vue+Element+axios实现的，服务端基于node.js。
项目收获:学习了css中伪元素的使用以及flex布局和定位以及node.js创建接口 项目地址:http://yuangauss287.top:8077/#/
教育经历
长沙学院 2018年09月 - 2022年06月 计算机科学与技术 本科
主修课程:计算机网络、数据结构、操作系统、数据库、高等数学、离散数学等。
获奖经历
1.“创青春”省级项目、软件著作权一项。
2.2019年湖南省第十五届“强智杯”大学生程序设计竞赛一等奖、2020年湖南省第十六届“强智杯”大学生程序设计竞赛二等 奖。
3.2020湖南省大学生计算机作品赛三等奖。 4.“互联网+”三等奖。
个人总结
1. 对软件、IT行业有着绝对的兴趣，对新的实物有着极大的热情并保持积极的态度。 2.学习能力良好,有较强的自学能力，有满足感。 3.有良好的团队协作能力，良好的沟通能力和认真负责的工作态度，在实验室项目组中担任组长。 4.热爱学习，注重提升自己，平时善于总结，会把总结写到个人博客中，且平时热爱阅读书籍，了解新的技术。 附上个人博客地址:http://yuangauss.xyz/
权限管理项目地址:http://yuangauss287.top:8899/

求职人：邓苏沅
2021年9月10日